<template>
    <div class="hello">
      <h1>Асимметричное шифрование</h1>
      <p>Асимметричное шифрование — это метод шифрования данных, предполагающий использование двух ключей — открытого и закрытого. Открытый (публичный) ключ применяется для шифрования информации и может передаваться по незащищенным каналам. Закрытый (приватный) ключ применяется для расшифровки данных, зашифрованных открытым ключом. Открытый и закрытый ключи — это очень большие числа, связанные друг с другом определенной функцией, но так, что, зная одно, крайне сложно вычислить второе.</p>
      <p>Асимметричное шифрование используется для защиты информации при ее передаче, также на его принципах построена работа электронных подписей.</p>

      <div class="block">
        <div class="block_name">Принцип действия асимметричного шифрования</div>
        <div class="block_paragraph">Схема передачи данных между двумя субъектами (А и Б) с использованием открытого ключа выглядит следующим образом:
        <ul>
          <li>Субъект А генерирует пару ключей, открытый и закрытый (публичный и приватный).</li>
          <li>Субъект А передает открытый ключ субъекту Б. Передача может осуществляться по незащищенным каналам.</li>
          <li>Субъект Б шифрует пакет данных при помощи полученного открытого ключа и передает его А. Передача может осуществляться по незащищенным каналам.</li>
          <li>Субъект А расшифровывает полученную от Б информацию при помощи секретного, закрытого ключа.</li>
        </ul>
        <div class="block_paragraph">В такой схеме перехват любых данных, передаваемых по незащищенным каналам, не имеет смысла, поскольку восстановить исходную информацию возможно только при помощи закрытого ключа, известного лишь получателю и не требующего передачи.</div>


</div>
      </div>

      <div class="block">
        <div class="block_name">Применение асимметричных алгоритмов</div>
        <div class="block_paragraph">Асимметричное шифрование решает главную проблему симметричного метода, при котором для кодирования и восстановления данных используется один и тот же ключ. Если передавать этот ключ по незащищенным каналам, его могут перехватить и получить доступ к зашифрованным данным. С другой стороны, асимметричные алгоритмы гораздо медленнее симметричных, поэтому во многих криптосистемах применяются и те и другие.</div>
        <div class="block_paragraph">Например, стандарты SSL и TLS используют асимметричный алгоритм на стадии установки соединения (рукопожатия): с его помощью кодируют и передают ключ от симметричного шифра, которым и пользуются в ходе дальнейшей передачи данных.</div>
        <div class="block_paragraph">Также асимметричные алгоритмы применяются для создания электронных подписей для подтверждения авторства и (или) целостности данных. При этом подпись генерируется с помощью закрытого ключа, а проверяется с помощью открытого.</div>

      </div>

      <div class="block">
        <div class="block_name">Асимметричные алгоритмы</div>
        <div class="block_paragraph">
          <ul>
            <li>RSA (аббревиатура от Rivest, Shamir и Adelman, фамилий создателей алгоритма) — алгоритм, в основе которого лежит вычислительная сложность факторизации (разложения на множители) больших чисел. Применяется в защищенных протоколах SSL и TLS, стандартах шифрования, например в PGP и S/MIME, и так далее. Используется и для шифрования данных, и для создания цифровых подписей.</li>
            <li>DSA (Digital Signature Algorithm, «алгоритм цифровой подписи») — алгоритм, основанный на сложности вычисления дискретных логарифмов. Используется для генерации цифровых подписей. Является частью стандарта DSS (Digital Signature Standard, «стандарт цифровой подписи»).</li>
            <li>Схема Эль-Гамаля — алгоритм, основанный на сложности вычисления дискретных логарифмов. Лежит в основе DSA и устаревшего российского стандарта ГОСТ 34.10–94. Применяется как для шифрования, так и для создания цифровых подписей.</li>
            <li>ECDSA (Elliptic Curve Digital Signature Algorithm) — алгоритм, основанный на сложности вычисления дискретного логарифма в группе точек эллиптической кривой. Применяется для генерации цифровых подписей, в частности для подтверждения транзакций в криптовалюте Ripple.</li>
          </ul>
        </div>
      </div>

      <div class="block">
        <div class="block_name">Надежность асимметричного шифрования</div>
        <div class="block_paragraph">Теоретически приватный ключ от асимметричного шифра можно вычислить, зная публичный ключ и механизм, лежащий в основе алгоритма шифрования (последнее — открытая информация). Надежными считаются шифры, для которых это нецелесообразно с практической точки зрения. Так, на взлом шифра, выполненного с помощью алгоритма RSA с ключом длиной 768 бит на компьютере с одноядерным процессором AMD Opteron с частотой 2,2 ГГц, бывшем в ходу в середине 2000-х, ушло бы 2000 лет.</div>
        <div class="block_paragraph">При этом фактическая надежность шифрования зависит в основном от длины ключа и сложности решения задачи, лежащей в основе алгоритма шифрования, для существующих технологий. Поскольку производительность вычислительных машин постоянно растет, длину ключей необходимо время от времени увеличивать. Так, в 1977-м (год публикации алгоритма RSA) невозможной с практической точки зрения считалась расшифровка сообщения, закодированного с помощью ключа длиной 426 бит, а сейчас для шифрования этим методом используются ключи от 1024 до 4096 бит, причем первые уже переходят в категорию ненадежных.</div>
        <div class="block_paragraph">Что касается эффективности поиска ключа, то она незначительно меняется с течением времени, но может скачкообразно увеличиться с появлением кардинально новых технологий (например, квантовых компьютеров). В этом случае может потребоваться поиск альтернативных подходов к шифрованию.</div>
      </div>
    </div>
  </template>
  
  <script>
  export default {
    name: 'Asimmetrical',
    props: {
    }
  }
  </script>
  
  <!-- Add "scoped" attribute to limit CSS to this component only -->
 <!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

.block{
  margin-top: 20px;
}
.block_name{
  font-size: 50px;
}
.block_paragraph{
  font-weight: 300;
  font-size: 20px;
  margin-top: 20px;
}


.hello{
  padding-left: 20px;
  padding-right: 20px;
 /* padding-top: 30px; */
}

p{
  font-size: 25px;
}

h1{
  font-size: 80px;
  margin-top: 120px;
  margin-bottom: 0px;
}

li{
  padding: 10px;
}
</style>
