<template>
  <div class="hello">

    <div class="heading">
      <h1>Криптография</h1>
      <p>
        наука о методах обеспечения конфиденциальности, целостности данных, аутентификации, шифрования.
      </p>
    </div>

    <div class="block">
      <div class="block_name"></div>
      <div class="block_paragraph">Изначально криптография изучала методы шифрования информации — обратимого преобразования открытого (исходного) текста на основе секретного алгоритма или ключа в шифрованный текст (шифротекст). Традиционная криптография образует раздел симметричных криптосистем, в которых зашифровывание и расшифровывание проводится с использованием одного и того же секретного ключа</div>
      <div class="block_paragraph">современная криптография включает в себя асимметричные криптосистемы, системы электронной цифровой подписи (ЭЦП), хеш-функции, управление ключами, получение скрытой информации, квантовую криптографию.</div>
      <div class="block_paragraph">Криптография не является защитой от обмана, подкупа или шантажа законных абонентов, кражи ключей и других угроз информации, возникающих в защищённых системах передачи данных. </div>
      <div class="block_paragraph">Криптография — одна из старейших наук, её история насчитывает несколько тысяч лет.</div>
    </div>

    <div class="block">
      <div class="block_name">Терминология</div>
      <ul>
        <li>Открытый (исходный) текст — данные (не обязательно текстовые), передаваемые без использования криптографии или другими словами незашифрованные данные.</li>
        <li>Шифротекст, шифрованный (закрытый) текст — данные, полученные после применения криптосистемы (обычно — с некоторым указанным ключом). Другое название: криптограмма.</li>
        <li>Шифр, криптосистема — семейство обратимых преобразований открытого текста в шифрованный.</li>
        <li>Ключ — параметр шифра, определяющий выбор конкретного преобразования данного текста. В современных шифрах криптографическая стойкость шифра целиком определяется секретностью ключа (принцип Керкгоффса). Также выделяют ключ шифрования (encryption key) и ключ расшифрования (decryption key)</li>
        <li>Шифрование — процесс нормального применения криптографического преобразования открытого текста на основе алгоритма и ключа, в результате которого возникает шифрованный текст.</li>
        <li>Расшифровывание — процесс нормального применения криптографического преобразования шифрованного текста в открытый.</li>
        <li>Асимметричный шифр, двухключевой шифр, шифр с открытым ключом — шифр, в котором используются два ключа, шифрующий и расшифровывающий. При этом, зная лишь ключ зашифровывания, нельзя расшифровать сообщение, и наоборот.</li>
        <li>Открытый ключ — тот из двух ключей асимметричной системы, который свободно распространяется. Шифрующий для секретной переписки и расшифровывающий — для электронной подписи.</li>
        <li>Секретный ключ, закрытый ключ — тот из двух ключей асимметричной системы, который хранится в секрете.</li>
        <li>Криптоанализ — наука, изучающая математические методы нарушения конфиденциальности и целостности информации.</li>
        <li>Криптографическая атака — попытка криптоаналитика вызвать отклонения в атакуемой защищённой системе обмена информацией. Успешную криптографическую атаку называют взлом или вскрытие.</li>
        <li>Дешифрование (дешифровка) — процесс извлечения открытого текста без знания криптографического ключа на основе известного шифрованного. Термин дешифрование обычно применяют по отношению к процессу криптоанализа шифротекста (криптоанализ сам по себе, вообще говоря, может заключаться и в анализе криптосистемы, а не только зашифрованного ею открытого сообщения).</li>
        <li>Криптографическая стойкость — способность криптографического алгоритма противостоять криптоанализу.</li>
        <li>Хеш-функция — функция, которая преобразует сообщение произвольной длины в число («свёртку») фиксированной длины. Для криптографической хеш-функции (в отличие от хеш-функции общего назначения) сложно вычислить обратную и даже найти два сообщения с общей хеш-функцией.</li>
        <li>Гибри́дная криптосисте́ма — это система шифрования, совмещающая преимущества криптосистемы с открытым ключом с производительностью симметричных криптосистем.</li>
      </ul>
    </div>

    <div class="block">
      <div class="block_name">История</div>
      <div class="block_paragraph">История криптографии насчитывает около 4 тысяч лет. В качестве основного критерия периодизации криптографии возможно использовать технологические характеристики используемых методов шифрования. </div>
      <div class="block_paragraph">Первый период (приблизительно с 3-го тысячелетия до н. э.) характеризуется господством моноалфавитных шифров (основной принцип — замена алфавита исходного текста другим алфавитом через замену букв другими буквами или символами). Второй период (хронологические рамки — с IX века на Ближнем Востоке (Ал-Кинди) и с XV века в Европе (Леон Баттиста Альберти) — до начала XX века) ознаменовался введением в обиход полиалфавитных шифров. Третий период (с начала и до середины XX века) характеризуется внедрением электромеханических устройств в работу шифровальщиков. При этом продолжалось использование полиалфавитных шифров</div>
      <div class="block_paragraph">Четвёртый период — с середины до 70-х годов XX века — период перехода к математической криптографии. В работе Шеннона появляются строгие математические определения количества информации, передачи данных, энтропии, функций шифрования. Обязательным этапом создания шифра считается изучение его уязвимости для различных известных атак — линейного и дифференциального криптоанализа. Однако, до 1975 года криптография оставалась «классической», или же, более корректно, криптографией с секретным ключом. </div>
      <div class="block_paragraph">Современный период развития криптографии (с конца 1970-х годов по настоящее время) отличается зарождением и развитием нового направления — криптография с открытым ключом. Её появление знаменуется не только новыми техническими возможностями, но и сравнительно широким распространением криптографии для использования частными лицами (в предыдущие эпохи использование криптографии было исключительной прерогативой государства). Правовое регулирование использования криптографии частными лицами в разных странах сильно различается — от разрешения до полного запрета. </div>
      <div class="block_paragraph">Современная криптография образует отдельное научное направление на стыке математики и информатики — работы в этой области публикуются в научных журналах, организуются регулярные конференции. Практическое применение криптографии стало неотъемлемой частью жизни современного общества — её используют в таких отраслях как электронная коммерция, электронный документооборот (включая цифровые подписи), телекоммуникации и других. </div>
    </div>

    <div class="block">
      <div class="block_name">Современная критпография</div>
      <div class="block_paragraph">Для современной криптографии характерно использование открытых алгоритмов шифрования, предполагающих использование вычислительных средств. Известно более десятка проверенных алгоритмов шифрования, которые при использовании ключа достаточной длины и корректной реализации алгоритма криптографически стойки. </div>
      <div class="block_paragraph">Распространённые алгоритмы: </div>
      <ul>
        <li>симметричные DES, AES, ГОСТ 28147-89, Camellia, Twofish, Blowfish, IDEA, RC4 и др.;</li>
        <li>асимметричные RSA и Elgamal (Эль-Гамаль)</li>
        <li>хеш-функций MD4, MD5, MD6, SHA-1, SHA-2, ГОСТ Р 34.11-2012 («Стрибог») </li>
      </ul>
      <div class="block_paragraph">Криптографические методы стали широко использоваться частными лицами в электронных коммерческих операциях, телекоммуникациях и многих других средах. </div>
      <div class="block_paragraph">Во многих странах приняты национальные стандарты шифрования. В 2001 году в США принят стандарт симметричного шифрования AES на основе алгоритма Rijndael с длиной ключа 128, 192 и 256 бит. Алгоритм AES пришёл на смену прежнему алгоритму DES, который теперь рекомендовано использовать только в режиме Triple DES. </div>

    </div>
  </div>


</template>

<script>
export default {
  name: 'Cryptography',
  props: {
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

.block{
  margin-top: 20px;
}
.block_name{
  font-size: 50px;
}
.block_paragraph{
  font-weight: 300;
  font-size: 20px;
  margin-top: 20px;
}


.hello{
  padding-left: 20px;
  padding-right: 20px;
 /* padding-top: 30px; */
}

p{
  font-size: 25px;
}

h1{
  font-size: 80px;
  margin-top: 120px;
  margin-bottom: 0px;
}

li{
  padding: 10px;
}
</style>
