<template>
    <div class="hello">
      <h1>Симмтеричное шифрование</h1>
      <p>это способ шифрования данных, при котором один и тот же ключ используется и для кодирования, и для восстановления информации. До 1970-х годов, когда появились первые асимметричные шифры, оно было единственным криптографическим методом.</p>
      <div class="block">
        <div class="block_name">Принцип работы симметричных алгоритмов</div>
        <div class="block_paragraph">В целом симметричным считается любой шифр, использующий один и тот же секретный ключ для шифрования и расшифровки.</div>
        <div class="block_paragraph">Например, если алгоритм предполагает замену букв числами, то и у отправителя сообщения, и у его получателя должна быть одна и та же таблица соответствия букв и чисел: первый с ее помощью шифрует сообщения, а второй — расшифровывает.</div>
        <div class="block_paragraph">Однако такие простейшие шифры легко взломать — например, зная частотность разных букв в языке, можно соотносить самые часто встречающиеся буквы с самыми многочисленными числами или символами в коде, пока не удастся получить осмысленные слова. С использованием компьютерных технологий такая задача стала занимать настолько мало времени, что использование подобных алгоритмов утратило всякий смысл.</div>
        <div class="block_paragraph">Поэтому современные симметричные алгоритмы считаются надежными, если отвечают следующим требованиям:

Выходные данные не должны содержать статистических паттернов исходных данных (как в примере выше: наиболее частотные символы осмысленного текста не должны соответствовать наиболее частотным символам шифра).
Шифр должен быть нелинейным (то есть в шифрованных данных не должно быть закономерностей, которые можно отследить, имея на руках несколько открытых текстов и шифров к ним).
</div>
        <div class="block_paragraph">Большинство актуальных симметричных шифров для достижения результатов, соответствующих этим требованиям, используют комбинацию операций подстановки (замена фрагментов исходного сообщения, например букв, на другие данные, например цифры, по определенному правилу или с помощью таблицы соответствий) и перестановки (перемешивание частей исходного сообщения по определенному правилу), поочередно повторяя их. Один круг шифрования, состоящий из этих операций, называется раундом.</div>

      </div>

      <div class="block">
        <div class="block_name">Виды алгоритмов симметричного шифрования</div>
        <div class="block_paragraph">В зависимости от принципа работы алгоритмы симметричного шифрования делятся на два типа:</div>
        <ul>
          <li>блочные;</li>
          <li>потоковые.</li>
        </ul>
        <div class="block_paragraph">
          Блочные алгоритмы шифруют данные блоками фиксированной длины (64, 128 или другое количество бит в зависимости от алгоритма). Если все сообщение или его финальная часть меньше размера блока, система дополняет его предусмотренными алгоритмом символами, которые так и называются дополнением.
        </div>
        <div class="block_paragraph">К актуальным блочным алгоритмам относятся:
        <ul>
          <li>AES</li>
          <li>ГОСТ 28147-89</li>
          <li>RC5</li>
          <li>Blowfish</li>
          <li>Twofish</li>
        </ul>
        <div class="block_paragraph">Потоковое шифрование данных предполагает обработку каждого бита информации с использованием гаммирования, то есть изменения этого бита с помощью соответствующего ему бита псевдослучайной секретной последовательности чисел, которая формируется на основе ключа и имеет ту же длину, что и шифруемое сообщение. Как правило, биты исходных данных сравниваются с битами секретной последовательности с помощью логической операции XOR (исключающее ИЛИ, на выходе дающее 0, если значения битов совпадают, и 1, если они различаются).</div>
        <div class="block_paragraph">Потоковое шифрование в настоящее время используют следующие алгоритмы:</div>
        <ul>
          <li>RC4</li>
          <li>Salsa20</li>
          <li>HC-256</li>
          <li>WAKE</li>
        </ul>
      </div>
      </div>

      <div class="block">
        <div class="block_name">Достоинства и недостатки симметричного шифрования</div>
        <div class="block_paragraph">Симметричные алгоритмы требуют меньше ресурсов и демонстрируют большую скорость шифрования, чем асимметричные алгоритмы. Большинство симметричных шифров предположительно устойчиво к атакам с помощью квантовых компьютеров, которые в теории представляют угрозу для асимметричных алгоритмов.</div>
        <div class="block_paragraph">Слабое место симметричного шифрования — обмен ключом. Поскольку для работы алгоритма ключ должен быть и у отправителя, и у получателя сообщения, его необходимо передать; однако при передаче по незащищенным каналам его могут перехватить и использовать посторонние. На практике во многих системах эта проблема решается шифрованием ключа с помощью асимметричного алгоритма.</div>
      </div>

      <div class="block">
        <div class="block_name">Область применения симметричного шифрования</div>
        <div class="block_paragraph">Симметричное шифрование используется для обмена данными во многих современных сервисах, часто в сочетании с асимметричным шифрованием. Например, мессенджеры защищают с помощью таких шифров переписку (при этом ключ для симметричного шифрования обычно доставляется в асимметрично зашифрованном виде), а сервисы для видеосвязи — потоки аудио и видео. В защищенном транспортном протоколе TLS симметричное шифрование используется для обеспечения конфиденциальности передаваемых данных.</div>
        <div class="block_paragraph">Симметричные алгоритмы не могут применяться для формирования цифровых подписей и сертификатов, потому что секретный ключ при использовании этого метода должен быть известен всем, кто работает с шифром, что противоречит самой идее электронной подписи (возможности проверки ее подлинности без обращения к владельцу).</div>
      </div>


    </div>
  </template>
  
  <script>
  export default {
    name: 'Simmetrical',
    props: {
    }
  }
  </script>
  
 <!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>

.block{
  margin-top: 20px;
}
.block_name{
  font-size: 50px;
}
.block_paragraph{
  font-weight: 300;
  font-size: 20px;
  margin-top: 20px;
}


.hello{
  padding-left: 20px;
  padding-right: 20px;
 /* padding-top: 30px; */
}

p{
  font-size: 25px;
}

h1{
  font-size: 80px;
  margin-top: 120px;
  margin-bottom: 0px;
}

li{
  padding: 10px;
}
</style>
